from random import choice

# Список слов для игры
word_list = [
    "абажур", "абрикос", "авария", "адрес", "агент", "азбука", "академия", "аквариум", "акула", "алхимик",
    "амбар", "амфибия", "ангел", "антенна", "апельсин", "арбуз", "арка", "армия", "арфа", "асфальт",
    "атом", "афиша", "баклажан", "балкон", "банка", "барсук", "башня", "бегемот", "береза", "бинокль",
    "бисер", "блюдо", "болото", "ботинок", "браслет", "бревно", "броня", "брошюра", "будка", "буйвол",
    "булка", "бутон", "вафля", "ведро", "весло", "ветка", "ветер", "вилка", "вишня", "вокзал",
    "волна", "ворона", "волосы", "восток", "время", "вьюга", "глина", "глобус", "голубь", "гора",
    "город", "гроза", "дверь", "диван", "дождь", "доска", "дочка", "дракон", "друг", "дудка",
    "жираф", "журнал", "завтрак", "завод", "забор", "закат", "замок", "занавес", "запись", "заряд",
    "зебра", "зелень", "земля", "зеркало", "знание", "игла", "игрушка", "изба", "инструмент", "индюк",
    "икона", "история", "кабан", "кабель", "калитка", "камень", "канат", "капля", "корабль", "коробка",
    "корова", "костер", "котел", "котик", "краска", "крест", "кролик", "крыша", "кубок", "куст",
    "курица", "курс", "лава", "лавка", "лампа", "лапа", "ласточка", "лес", "лестница", "лицо",
    "лодка", "ложка", "малина", "мальчик", "маска", "мастер", "матрос", "медведь", "мельница", "мечта",
    "мишка", "молот", "молоко", "морковь", "мороз", "мостик", "мотор", "мрамор", "мрак", "мыло",
    "мясо", "мышка", "неделя", "невод", "ночь", "облако", "обувь", "овощи", "овца", "огонь",
    "одежда", "окно", "олень", "орех", "остров", "охота", "очки", "пакет", "палка", "память",
    "пароход", "парень", "парта", "пастух", "паук", "пена", "песок", "печка", "пианино", "пила",
    "письмо", "пицца", "планета", "платье", "плита", "плод", "плуг", "погода", "подушка", "поезд",
    "поэзия", "поле", "полка", "полоса", "порог", "портфель", "почта", "правда", "праздник", "предмет",
    "пряник", "пчела", "пятно", "река", "ремень", "репка", "речь", "роща", "рубль", "рубашка",
    "рука", "ручка", "рыба", "рынок", "садик", "сани", "сахар", "свет", "свеча", "свинья",
    "свитер", "семья", "сердце", "сирень", "скамья", "скворец", "скрипка", "слон", "случай", "снегопад",
    "собака", "солдат", "солнце", "сорока", "сосуд", "сосед", "соус", "спорт", "стена", "стул",
    "стиль", "ступень", "сцена", "сумка", "сундук", "сутки", "табак", "танец", "таракан", "тарелка",
    "тень", "тетрадь", "тесто", "тигр", "топор", "торт", "трава", "трамвай", "труба", "туман",
    "туфля", "ужин", "улица", "утро", "утка", "фазан", "файл", "факел", "фартук", "фигура",
    "фильм", "флаг", "фонарь", "форма", "фрукт", "хлеб", "хобот", "храм", "хвост", "цветок",
    "цель", "цирк", "цифра", "часы", "чашка", "человек", "черепаха", "чернила", "чертеж", "чеснок",
    "чулан", "шапка", "шарик", "шкаф", "школа", "шкура", "шлем", "шляпа", "штора", "щетка",
    "щука", "экран", "электричка", "эмаль", "ягуар", "ягода", "якорь", "январь", "ястреб", "ящик",
    "яблоко", "ярмарка"
]


# Функция отображения виселицы в зависимости от оставшихся попыток
def display_hangman(tries):
    stages = [  
                # финальное состояние: голова, торс, обе руки, обе ноги
                '''
                    ───────  
                    |     |  
                    |    💀  
                    |    /|\\  
                    |     |  
                    |    / \\  
                    ──  
                ''',
                # голова, торс, обе руки, одна нога
                '''
                    ───────  
                    |     |  
                    |    😵  
                    |    /|\\  
                    |     |  
                    |    /   
                    ── 
                ''',
                # голова, торс, обе руки
                '''
                    ───────  
                    |     |  
                    |    😨  
                    |    /|\\  
                    |     |  
                    |  
                    ──
                ''',
                # голова, торс и одна рука
                '''
                    ───────  
                    |     |  
                    |    😟  
                    |    /|  
                    |     |  
                    |  
                    ──
                ''',
                # голова и торс
                '''
                    ───────  
                    |     |  
                    |    😕  
                    |     |  
                    |     |  
                    |
                    ──
                ''',
                # голова
                '''
                    ───────  
                    |     |  
                    |    😐  
                    |  
                    |  
                    |
                    ──
                ''',
                # начальное состояние
                '''
                    ───────  
                    |     |  
                    |
                    |  
                    |  
                    |  
                    ──
                '''
    ]
    return stages[tries]


# Функция выбирает случайное слово из списка
def get_word():
    return choice(word_list).upper()


# Проверка корректности ввода
def checking_answer(answer):
    while not answer or not answer.isalpha():
        answer = input('Ошибка! Введите корректный ответ (буква/слово)! ')
    return answer


# Основная логика игры
def hangman(word):
    word_completion = '_' * len(word)
    guessed_letters = []  # Уже названные буквы
    guessed_words = []    # Уже названные слова
    tries = 6             # Количество попыток
    word_completion = list(word_completion)

    print(display_hangman(tries))
    print(''.join(word_completion))

    while tries > 0 and '_' in word_completion:
        answer = checking_answer(input('Введите букву или слово: ').upper()) # Ответ пользователя
        print()
        
        if len(answer) == 1:  # Если введена буква
            if answer in guessed_letters:
                print('Вы уже это вводили, попробуйте еще раз!')
            elif answer in word:  # Буква угадана
                for i in range(len(word)):
                    if answer == word[i]:
                        word_completion[i] = answer
            else:  # Буквы нет в слове
                print('Мимо!')
                tries -= 1
            guessed_letters.append(answer)
        else:  # Если введено слово
            if answer in guessed_words:
                print('Вы уже это вводили, попробуйте еще раз!')
            elif answer == word:  # Слово угадано
                word_completion = list(word)
            else:  # Слово неверное
                print('Не угадали!')
                tries -= 1
                guessed_words.append(answer)

        print(display_hangman(tries))    # Текущее состояние виселицы
        print(''.join(word_completion))  # Текущее состояние слова
        
        # Завершение игры
        if tries == 0:
            print(f'Вы проиграли 😕. Слово: {word}')
            return
        if not '_' in word_completion:
            print('Поздравляем, вы выиграли! 🎉')
            return


# Основной цикл программы
def play():
    print('Давайте играть в угадайку слов!')
    hangman(get_word())
    while True:
        answer = input('Желаете сыграть еще раз? (да/нет) ').lower()
        while not answer in ['да', 'нет']:  # проверка корректности ответа
            answer = input('Введите "да" или "нет"! ').lower()
        if answer == 'да':
            hangman(get_word())
        else:
            break
    print('Спасибо за игру. Возвращайтесь еще!')


# Запуск игры
play()
